Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: وإذا قيل لهم تعالوا إلى ما أنزل الله وإلى الرسول قالوا حسبنا ما وجدنا عليه آباءنا أولو كان آباؤهم لا يعلمون شيئا ولا يهتدون
en: And when it is said to them: "Come to what Allah has revealed and unto the Messenger (Muhammad صلى الله عليه وسلم for the verdict of that which you have made unlawful)." They say: "Enough for us is that which we found our fathers following," even though their fathers had no knowledge whatsoever nor guidance.

source: يا أيها الذين آمنوا عليكم أنفسكم لا يضركم من ضل إذا اهتديتم إلى الله مرجعكم جميعا فينبئكم بما كنتم تعملون
en: O you who believe! Take care of your ownselves . If you follow the (right) guidance [and enjoin what is right (Islamic Monotheism and all that Islam orders one to do) and forbid what is wrong (polytheism, disbelief and all that Islam has forbidden)] no hurt can come to you from those who are in error. The return of you all is to Allah, then He will inform you about (all) that which you used to do.

source: يا أيها الذين آمنوا شهادة بينكم إذا حضر أحدكم الموت حين الوصية اثنان ذوا عدل منكم أو آخران من غيركم إن أنتم ضربتم في الأرض فأصابتكم مصيبة الموت تحبسونهما من بعد الصلاة فيقسمان بالله إن ارتبتم لا نشتري به ثمنا ولو كان ذا قربى ولا نكتم شهادة الله إنا إذا لمن الآثمين
en: O you who believe! When death approaches any of you, and you make a bequest, (then take) the testimony of two just men of your own folk or two others from outside, while you are travelling through the land and death befalls on you. Detain them both after As-Salat (the prayer), (then) if you are in doubt (about their truthfulness), let them both swear by Allah (saying): "We wish not for any worldly gain in this, even though he (the beneficiary) be our near relative. We shall not hide Testimony of Allah, for then indeed we should be of the sinful."

source: فإن عثر على أنهما استحقا إثما فآخران يقومان مقامهما من الذين استحق عليهم الأوليان فيقسمان بالله لشهادتنا أحق من شهادتهما وما اعتدينا إنا إذا لمن الظالمين
en: If then it gets known that these two had been guilty of sin, let two others stand forth in their places, nearest in kin from among those who claim a lawful right. Let them swear by Allah (saying): "We affirm that our testimony is truer than that of both of them, and that we have not trespassed (the truth), for then indeed we should be of the wrong-doers."

source: ذلك أدنى أن يأتوا بالشهادة على وجهها أو يخافوا أن ترد أيمان بعد أيمانهم واتقوا الله واسمعوا والله لا يهدي القوم الفاسقين
en: That should make it closer (to the fact) that their testimony would be in its true shape (and thus accepted), or else they would fear that (other) oaths would be admitted after their oaths. And fear Allah and listen (with obedience to Him). And Allah guides not the people who are Al-Fasiqun (the rebellious and disobedient).

source: يوم يجمع الله الرسل فيقول ماذا أجبتم قالوا لا علم لنا إنك أنت علام الغيوب
en: On the Day when Allah will gather the Messengers together and say to them: "What was the response you received (from men to your teaching)?" They will say: "We have no knowledge, verily, only You are the All-Knower of all that is hidden (or unseen)."

source: إذ قال الله يا عيسى ابن مريم اذكر نعمتي عليك وعلى والدتك إذ أيدتك بروح القدس تكلم الناس في المهد وكهلا وإذ علمتك الكتاب والحكمة والتوراة والإنجيل وإذ تخلق من الطين كهيئة الطير بإذني فتنفخ فيها فتكون طيرا بإذني وتبرئ الأكمه والأبرص بإذني وإذ تخرج الموتى بإذني وإذ كففت بني إسرائيل عنك إذ جئتهم بالبينات فقال الذين كفروا منهم إن هذا إلا سحر مبين
en: (Remember) when Allah will say (on the Day of Resurrection). "O 'Îsa (Jesus), son of Maryam (Mary)! Remember My Favour to you and to your mother when I supported you with Ruh-ul-Qudus [Jibril (Gabriel)] so that you spoke to the people in the cradle and in maturity; and when I taught you writing, Al-Hikmah (the power of understanding), the Taurat (Torah) and the Injeel (Gospel); and when you made out of the clay a figure like that of a bird, by My Permission, and you breathed into it, and it became a bird by My Permission, and you healed those born blind, and the lepers by My Permission, and when you brought forth the dead by My Permission; and when I restrained the Children of Israel from you (when they resolved to kill you) as you came unto them with clear proofs, and the disbelievers among them said: 'This is nothing but evident magic.'"

source: وإذ أوحيت إلى الحواريين أن آمنوا بي وبرسولي قالوا آمنا واشهد بأننا مسلمون
en: And when I (Allah) revealed to Al-Hawariyyun (the disciples) [of 'Îsa (Jesus)] to believe in Me and My Messenger, they said: "We believe. And bear witness that we are Muslims."

source: إذ قال الحواريون يا عيسى ابن مريم هل يستطيع ربك أن ينزل علينا مائدة من السماء قال اتقوا الله إن كنتم مؤمنين
en: (Remember) when Al-Hawariyyun (the disciples) said: "O 'Îsa (Jesus), son of Maryam (Mary)! Can your Lord send down to us a table spread (with food) from heaven?" 'Îsa (Jesus) said: "Fear Allah, if you are indeed believers."

source: قالوا نريد أن نأكل منها وتطمئن قلوبنا ونعلم أن قد صدقتنا ونكون عليها من الشاهدين
en: They said: "We wish to eat thereof and to satisfy our hearts (to be stronger in Faith), and to know that you have indeed told us the truth and that we ourselves be its witnesses."

source: قال عيسى ابن مريم اللهم ربنا أنزل علينا مائدة من السماء تكون لنا عيدا لأولنا وآخرنا وآية منك وارزقنا وأنت خير الرازقين
en: 'Îsa (Jesus), son of Maryam (Mary), said: "O Allah, our Lord! Send us from the heaven a table spread (with food) that there may be for us - for the first and the last of us - a festival and a sign from You; and provide us sustenance, for You are the Best of sustainers."

source: قال الله إني منزلها عليكم فمن يكفر بعد منكم فإني أعذبه عذابا لا أعذبه أحدا من العالمين
en: Allah said: "I am going to send it down unto you, but if any of you after that disbelieves, then I will punish him with a torment such as I have not inflicted on anyone among (all) the 'Alamin (mankind and jinn)."

source: وإذ قال الله يا عيسى ابن مريم أأنت قلت للناس اتخذوني وأمي إلهين من دون الله قال سبحانك ما يكون لي أن أقول ما ليس لي بحق إن كنت قلته فقد علمته تعلم ما في نفسي ولا أعلم ما في نفسك إنك أنت علام الغيوب
en: And (remember) when Allah will say (on the Day of Resurrection): "O 'Îsa (Jesus), son of Maryam (Mary)! Did you say unto men: 'Worship me and my mother as two gods besides Allah?' " He will say: "Glory be to You! It was not for me to say what I had no right (to say). Had I said such a thing, You would surely have known it. You know what is in my inner-self though I do not know what is in Yours; truly, You, only You, are the All-Knower of all that is hidden (and unseen).

source: ما قلت لهم إلا ما أمرتني به أن اعبدوا الله ربي وربكم وكنت عليهم شهيدا ما دمت فيهم فلما توفيتني كنت أنت الرقيب عليهم وأنت على كل شيء شهيد
en: "Never did I say to them aught except what You (Allah) did command me to say: 'Worship Allah, my Lord and your Lord.' And I was a witness over them while I dwelt amongst them, but when You took me up, You were the Watcher over them; and You are a Witness to all things. (This is a great admonition and warning to the Christians of the whole world).

source: إن تعذبهم فإنهم عبادك وإن تغفر لهم فإنك أنت العزيز الحكيم
en: "If You punish them, they are Your slaves, and if You forgive them, verily You, only You, are the All-Mighty, the All-Wise ."

source: قال الله هذا يوم ينفع الصادقين صدقهم لهم جنات تجري من تحتها الأنهار خالدين فيها أبدا رضي الله عنهم ورضوا عنه ذلك الفوز العظيم
en: Allah will say: "This is a Day on which the truthful will profit from their truth: theirs are Gardens under which rivers flow (in Paradise) - they shall abide therein forever. Allah is pleased with them and they with Him. That is the great success (Paradise).

source: لله ملك السماوات والأرض وما فيهن وهو على كل شيء قدير
en: To Allah belongs the dominion of the heavens and the earth and all that is therein, and He is Able to do all things.

source: الحمد لله الذي خلق السماوات والأرض وجعل الظلمات والنور ثم الذين كفروا بربهم يعدلون
en: All praises and thanks be to Allah, Who (Alone) created the heavens and the earth, and originated the darkness and the light; yet those who disbelieve hold others as equal with their Lord.

source: هو الذي خلقكم من طين ثم قضى أجلا وأجل مسمى عنده ثم أنتم تمترون
en: He it is Who has created you from clay, and then has decreed a (stated) term (for you to die). And there is with Him another determined term (for you to be resurrected), yet you doubt (in the Resurrection).

source: وهو الله في السماوات وفي الأرض يعلم سركم وجهركم ويعلم ما تكسبون
en: And He is Allah (to be worshipped Alone) in the heavens and on the earth; He knows what you conceal and what you reveal, and He knows what you earn (good or bad). (See V.43:84)

source: وما تأتيهم من آية من آيات ربهم إلا كانوا عنها معرضين
en: And never an Ayah (sign) comes to them from the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) of their Lord, but that they have been turning away from it.

source: فقد كذبوا بالحق لما جاءهم فسوف يأتيهم أنباء ما كانوا به يستهزئون
en: Indeed, they rejected the truth (the Qur'an and Muhammad صلى الله عليه وسلم) when it came to them, but there will come to them the news of that (the torment) which they used to mock at.

source: ألم يروا كم أهلكنا من قبلهم من قرن مكناهم في الأرض ما لم نمكن لكم وأرسلنا السماء عليهم مدرارا وجعلنا الأنهار تجري من تحتهم فأهلكناهم بذنوبهم وأنشأنا من بعدهم قرنا آخرين
en: Have they not seen how many a generation before them We have destroyed whom We had established on the earth such as We have not established you? And We poured out on them rain from the sky in abundance, and made the rivers flow under them. Yet We destroyed them for their sins, and We created after them other generations.

source: ولو نزلنا عليك كتابا في قرطاس فلمسوه بأيديهم لقال الذين كفروا إن هذا إلا سحر مبين
en: And even if We had sent down unto you (O Muhammad صلى الله عليه وسلم) a Message written on paper so that they could touch it with their hands, the disbelievers would have said: "This is nothing but obvious magic!"

source: وقالوا لولا أنزل عليه ملك ولو أنزلنا ملكا لقضي الأمر ثم لا ينظرون
en: And they say: "Why has not an angel been sent down to him?" Had We sent down an angel, the matter would have been judged at once, and no respite would be granted to them.

source: ولو جعلناه ملكا لجعلناه رجلا وللبسنا عليهم ما يلبسون
en: And had We appointed him an angel, We indeed would have made him a man, and We would have certainly confused them in which they are already confused (i.e. the Message of Prophet Muhammad صلى الله عليه وسلم).

source: ولقد استهزئ برسل من قبلك فحاق بالذين سخروا منهم ما كانوا به يستهزئون
en: And indeed (many) Messengers before you were mocked at, but their scoffers were surrounded by the very thing that they used to mock at.

source: قل سيروا في الأرض ثم انظروا كيف كان عاقبة المكذبين
en: Say (O Muhammad صلى الله عليه وسلم): "Travel in the land and see what was the end of those who rejected truth."

source: قل لمن ما في السماوات والأرض قل لله كتب على نفسه الرحمة ليجمعنكم إلى يوم القيامة لا ريب فيه الذين خسروا أنفسهم فهم لا يؤمنون
en: Say (O Muhammad صلى الله عليه وسلم): "To whom belongs all that is in the heavens and the earth?" Say: "To Allah. He has prescribed Mercy for Himself. Indeed He will gather you together on the Day of Resurrection, about which there is no doubt. Those who have lost themselves will not believe [in Allah as being the only Ilah (God), and Muhammad صلى الله عليه وسلم as being one of His Messengers, and in Resurrection].

source: وله ما سكن في الليل والنهار وهو السميع العليم
en: And to Him belongs whatsoever exists in the night and the day, and He is the All-Hearing, the All-Knowing."

source: قل أغير الله أتخذ وليا فاطر السماوات والأرض وهو يطعم ولا يطعم قل إني أمرت أن أكون أول من أسلم ولا تكونن من المشركين
en: Say (O Muhammad صلى الله عليه وسلم): "Shall I take as a Wali (Helper, Protector, Lord or God) any other than Allah, the Creator of the heavens and the earth? And it is He Who feeds but is not fed." Say: "Verily, I am commanded to be the first of those who submit themselves to Allah (as Muslims)." And be not you (O Muhammad صلى الله عليه وسلم) of the Mushrikun [polytheists, pagans, idolaters and disbelievers in the Oneness of Allah]. (Tafsir Al-Qurtubi)

source: قل إني أخاف إن عصيت ربي عذاب يوم عظيم
en: Say: "I fear, if I disobey my Lord, the torment of a Mighty Day."

source: من يصرف عنه يومئذ فقد رحمه وذلك الفوز المبين
en: He who is averted from (such a torment) on that Day, (Allah) has surely been Merciful to him. And that would be the obvious success.

source: وإن يمسسك الله بضر فلا كاشف له إلا هو وإن يمسسك بخير فهو على كل شيء قدير
en: And if Allah touches you with harm, none can remove it but He, and if He touches you with good, then He is Able to do all things.

source: وهو القاهر فوق عباده وهو الحكيم الخبير
en: And He is the Irresistible, (Supreme) above His slaves, and He is the All-Wise, Well-Acquainted with all things.

source: قل أي شيء أكبر شهادة قل الله شهيد بيني وبينكم وأوحي إلي هذا القرآن لأنذركم به ومن بلغ أئنكم لتشهدون أن مع الله آلهة أخرى قل لا أشهد قل إنما هو إله واحد وإنني بريء مما تشركون
en: Say (O Muhammad صلى الله عليه وسلم): "What thing is the most great in witness?" Say: "Allah (the Most Great!) is Witness between me and you; this Qur'an has been revealed to me that I may therewith warn you and whomsoever it may reach. Can you verily bear witness that besides Allah there are other alihah (gods)?" Say "I bear no (such) witness!" Say: "But in truth He (Allah) is the only one Ilah (God). And truly I am innocent of what you join in worship with Him."

source: الذين آتيناهم الكتاب يعرفونه كما يعرفون أبناءهم الذين خسروا أنفسهم فهم لا يؤمنون
en: Those to whom We have given the Scripture (Jews and Christians) recognize him (i.e. Muhammad صلى الله عليه وسلم as a Messenger of Allah, and they also know that there is no Ilah (God) but Allah and Islam is Allah's Religion), as they recognize their own sons. Those who have lost (destroyed) themselves will not believe. (Tafsir At-Tabari).

source: ومن أظلم ممن افترى على الله كذبا أو كذب بآياته إنه لا يفلح الظالمون
en: And who does more aggression and wrong than he who invents a lie against Allah or rejects His Ayat (proofs, evidence, verses, lessons or revelations)? Verily, the Zalimun (polytheists and wrong-doers) shall never be successful.

source: ويوم نحشرهم جميعا ثم نقول للذين أشركوا أين شركاؤكم الذين كنتم تزعمون
en: And on the Day when We shall gather them all together, then We shall say to those who joined partners (in worship with Us): "Where are your partners (false deities) whom you used to assert (as partners in worship with Allah)?"

source: ثم لم تكن فتنتهم إلا أن قالوا والله ربنا ما كنا مشركين
en: There will then be (left) no Fitnah (excuses or statements or arguments) for them but to say: "By Allah, our Lord, we were not those who joined others in worship with Allah."

source: انظر كيف كذبوا على أنفسهم وضل عنهم ما كانوا يفترون
en: Look! How they lie against themselves! But the (lie) which they invented will disappear from them.

source: ومنهم من يستمع إليك وجعلنا على قلوبهم أكنة أن يفقهوه وفي آذانهم وقرا وإن يروا كل آية لا يؤمنوا بها حتى إذا جاءوك يجادلونك يقول الذين كفروا إن هذا إلا أساطير الأولين
en: And of them there are some who listen to you; but We have set veils on their hearts, so they understand it not, and deafness in their ears; and even if they see every one of the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) they will not believe therein; to the point that when they come to you to argue with you, the disbelievers say: "These are nothing but tales of the men of old."

source: وهم ينهون عنه وينأون عنه وإن يهلكون إلا أنفسهم وما يشعرون
en: And they prevent others from him (from following Prophet Muhammad صلى الله عليه وسلم) and they themselves keep away from him, and (by doing so) they destroy not but their ownselves, yet they perceive (it) not.

source: ولو ترى إذ وقفوا على النار فقالوا يا ليتنا نرد ولا نكذب بآيات ربنا ونكون من المؤمنين
en: If you could but see when they will be held over the (Hell) Fire! They will say: "Would that we were but sent back (to the world)! Then we would not deny the Ayat (proofs, evidence, verses, lessons, revelations, etc.) of our Lord, and we would be of the believers!"

source: بل بدا لهم ما كانوا يخفون من قبل ولو ردوا لعادوا لما نهوا عنه وإنهم لكاذبون
en: Nay, it has become manifest to them what they had been concealing before. But if they were returned (to the world), they would certainly revert to that which they were forbidden. And indeed they are liars.

source: وقالوا إن هي إلا حياتنا الدنيا وما نحن بمبعوثين
en: And they said: "There is no (other life) but our (present) life of this world, and never shall we be resurrected (on the Day of Resurrection)."

source: ولو ترى إذ وقفوا على ربهم قال أليس هذا بالحق قالوا بلى وربنا قال فذوقوا العذاب بما كنتم تكفرون
en: If you could but see when they will be held (brought and made to stand) in front of their Lord! He will say: "Is not this (Resurrection and the taking of the accounts) the truth?" They will say: "Yes, by our Lord!" He will then say: "So taste you the torment because you used not to believe."

source: قد خسر الذين كذبوا بلقاء الله حتى إذا جاءتهم الساعة بغتة قالوا يا حسرتنا على ما فرطنا فيها وهم يحملون أوزارهم على ظهورهم ألا ساء ما يزرون
en: They indeed are losers who denied their Meeting with Allah, until all of a sudden, the Hour (signs of death) is on them, and they say: "Alas for us that we gave no thought to it," while they will bear their burdens on their backs; and evil indeed are the burdens that they will bear!

source: وما الحياة الدنيا إلا لعب ولهو وللدار الآخرة خير للذين يتقون أفلا تعقلون
en: And the life of this world is nothing but play and amusement. But far better is the house in the Hereafter for those who are Al-Muttaqun (the pious - See V.2:2). Will you not then understand?

source: قد نعلم إنه ليحزنك الذي يقولون فإنهم لا يكذبونك ولكن الظالمين بآيات الله يجحدون
en: We know indeed the grief which their words cause you (O Muhammad صلى الله عليه وسلم): it is not you that they deny, but it is the Verses (the Qur'an) of Allah that the Zalimun (polytheists and wrong-doers) deny.

source: ولقد كذبت رسل من قبلك فصبروا على ما كذبوا وأوذوا حتى أتاهم نصرنا ولا مبدل لكلمات الله ولقد جاءك من نبإ المرسلين
en: Verily, (many) Messengers were denied before you (O Muhammad صلى الله عليه وسلم), but with patience they bore the denial, and they were hurt; till Our Help reached them, and none can alter the Words (Decisions) of Allah. Surely there has reached you the information (news) about the Messengers (before you).

source: وإن كان كبر عليك إعراضهم فإن استطعت أن تبتغي نفقا في الأرض أو سلما في السماء فتأتيهم بآية ولو شاء الله لجمعهم على الهدى فلا تكونن من الجاهلين
en: If their aversion (from you, O Muhammad صلى الله عليه وسلم and from that with which you have been sent) is hard on you, (and you cannot be patient of their harm to you), then if you were able to seek a tunnel in the earth or a ladder to the sky, so that you may bring them a sign (and you cannot do it, so be patient). And had Allah willed, He could have gathered them together (all) on true guidance, so be not you one of those who are Al-Jahilun (the ignorant).

source: إنما يستجيب الذين يسمعون والموتى يبعثهم الله ثم إليه يرجعون
en: It is only those who listen (to the Message of Prophet Muhammad صلى الله عليه وسلم), will respond (benefit from it), but as for the dead (i.e. disbelievers), Allah will raise them up, then to Him they will be returned (for their recompense).

source: وقالوا لولا نزل عليه آية من ربه قل إن الله قادر على أن ينزل آية ولكن أكثرهم لا يعلمون
en: And they said: "Why is not a sign sent down to him from his Lord?" Say: "Allah is certainly Able to send down a sign, but most of them know not."

source: وما من دابة في الأرض ولا طائر يطير بجناحيه إلا أمم أمثالكم ما فرطنا في الكتاب من شيء ثم إلى ربهم يحشرون
en: There is not a moving (living) creature on earth, nor a bird that flies with its two wings, but are communities like you. We have neglected nothing in the Book, then unto their Lord they (all) shall be gathered.

source: والذين كذبوا بآياتنا صم وبكم في الظلمات من يشإ الله يضلله ومن يشأ يجعله على صراط مستقيم
en: Those who reject Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) are deaf and dumb in the darkness. Allah sends astray whom He wills and He guides on the Straight Path whom He wills.

source: قل أرأيتكم إن أتاكم عذاب الله أو أتتكم الساعة أغير الله تدعون إن كنتم صادقين
en: Say (O Muhammad صلى الله عليه وسلم): "Tell me if Allah's Torment comes upon you, or the Hour comes upon you, would you then call upon any one other than Allah? (Reply) if you are truthful!"

source: بل إياه تدعون فيكشف ما تدعون إليه إن شاء وتنسون ما تشركون
en: Nay! To Him Alone you would call, and, if He wills, He would remove that (distress) for which you call upon Him, and you would forget at that time whatever partners you joined (with Him in worship)!

source: ولقد أرسلنا إلى أمم من قبلك فأخذناهم بالبأساء والضراء لعلهم يتضرعون
en: Verily, We sent (Messengers) to many nations before you (O Muhammad صلى الله عليه وسلم). And We seized them with extreme poverty (or loss in wealth) and loss in health (with calamities) so that they might humble themselves (believe with humility).

source: فلولا إذ جاءهم بأسنا تضرعوا ولكن قست قلوبهم وزين لهم الشيطان ما كانوا يعملون
en: When Our Torment reached them, why then did they not humble themselves (believe with humility)? But their hearts became hardened, and Shaitan (Satan) made fair-seeming to them that which they used to do.

source: فلما نسوا ما ذكروا به فتحنا عليهم أبواب كل شيء حتى إذا فرحوا بما أوتوا أخذناهم بغتة فإذا هم مبلسون
en: So, when they forgot (the warning) with which they had been reminded, We opened for them the gates of every (pleasant) thing, until in the midst of their enjoyment in that which they were given, all of a sudden, We took them (in punishment), and lo! They were plunged into destruction with deep regrets and sorrows.

source: فقطع دابر القوم الذين ظلموا والحمد لله رب العالمين
en: So the root of the people who did wrong was cut off. And all the praises and thanks are to Allah, the Lord of the 'Alamin (mankind, jinn, and all that exists).

source: قل أرأيتم إن أخذ الله سمعكم وأبصاركم وختم على قلوبكم من إله غير الله يأتيكم به انظر كيف نصرف الآيات ثم هم يصدفون
en: Say (to the disbelievers): "Tell me, if Allah took away your hearing and your sight, and sealed up your hearts, who is there - an ilah (a god) other than Allah who could restore them to you?" See how variously We explain the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.), yet they turn aside.

source: قل أرأيتكم إن أتاكم عذاب الله بغتة أو جهرة هل يهلك إلا القوم الظالمون
en: Say: "Tell me, if the punishment of Allah comes to you suddenly (during the night), or openly (during the day), will any be destroyed except the Zalimun (polytheists and wrong-doing people)?"

source: وما نرسل المرسلين إلا مبشرين ومنذرين فمن آمن وأصلح فلا خوف عليهم ولا هم يحزنون
en: And We send not the Messengers but as givers of glad tidings and as warners. So whosoever believes and does righteous good deeds, upon such shall come no fear, nor shall they grieve.

source: والذين كذبوا بآياتنا يمسهم العذاب بما كانوا يفسقون
en: But those who reject Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.), the torment will touch them for their disbelief (and for their belying the Message of Muhammad صلى الله عليه وسلم). [Tafsir Al-Qurtubi].
